Функция Хорошо()
	
	РеализацияСсылка = Документы.РеализацияТоваровУслуг.НайтиДокумент();
	Если НЕ ЗначениеЗаполнено(РеализацияСсылка) Тогда
		РеализацияСсылка = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
	КонецЕсли;
	
	Возврат РеализацияСсылка;
	
КонецФункции

Функция Плохо()
	РеализацияСсылка = Документы.РеализацияТоваровУслуг.НайтиДокумент();
	Если ЗначениеЗаполнено(РеализацияСсылка) Тогда	
		Возврат РеализацияСсылка;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Функция Хорошо()	
	РеализацияСсылка = Документы.РеализацияТоваровУслуг.НайтиДокумент();
	СтруктураВозврата = Новый Структура;
	Если ЗначениеЗаполнено(РеализацияСсылка) Тогда
		СтруктураВозврата.Вставить("Документ",РеализацияСсылка);
		СтруктураВозврата.Вставить("Ошибка",Ложь);
	Иначе		
		СтруктураВозврата.Вставить("Документ",Неопределено);
		СтруктураВозврата.Вставить("Ошибка",Истина);		
	КонецЕсли;	
	
	Возврат СтруктураВозврата;
КонецФункции

Функция Плохо()
	РеализацияСсылка = Документы.РеализацияТоваровУслуг.НайтиДокумент();
	СтруктураВозврата = Новый Структура;
	Если ЗначениеЗаполнено(РеализацияСсылка) Тогда
		СтруктураВозврата.Вставить("Документ",РеализацияСсылка);
		СтруктураВозврата.Вставить("Ошибка",Ложь);
	Иначе		
		Возврат Ложь;		
	КонецЕсли;	
	
	Возврат СтруктураВозврата;	
КонецФункции